In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series(np.arange(3),index=['A','B','C'])

In [4]:
ser1

A    0
B    1
C    2
dtype: int32

In [6]:
ser1.drop('B')

A    0
C    2
dtype: int32

In [9]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','NY','PO'],columns=['pop','siz','yer'])

In [10]:
dframe1

    pop  siz  yer
SF    0    1    2
NY    3    4    5
PO    6    7    8

In [11]:
dframe1.drop('NY')

    pop  siz  yer
SF    0    1    2
PO    6    7    8

In [12]:
dframe1

    pop  siz  yer
SF    0    1    2
NY    3    4    5
PO    6    7    8

In [13]:
dframe2 = dframe1.drop('NY')

In [14]:
dframe2

    pop  siz  yer
SF    0    1    2
PO    6    7    8

In [15]:
dframe1

    pop  siz  yer
SF    0    1    2
NY    3    4    5
PO    6    7    8

In [16]:
dframe1.drop('yer',axis=1)

    pop  siz
SF    0    1
NY    3    4
PO    6    7